In [1]:
import pandas as pd
import numpy as np

In [2]:
customer_address_file = "/Users/ryotayamaoka/Desktop/kpmg/CustomerAddress.csv"

df = pd.read_csv(customer_address_file)

In [3]:
df.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [4]:
df.dtypes

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

In [6]:
df.info

<bound method DataFrame.info of       customer_id                    address  postcode            state  \
0               1         060 Morning Avenue      2016  New South Wales
1               2        6 Meadow Vale Court      2153  New South Wales
2               4         0 Holy Cross Court      4211              QLD
3               5        17979 Del Mar Point      2448  New South Wales
4               6           9 Oakridge Court      3216              VIC
...           ...                        ...       ...              ...
3994         3999            1482 Hauk Trail      3064              VIC
3995         4000  57042 Village Green Point      4511              QLD
3996         4001     87 Crescent Oaks Alley      2756              NSW
3997         4002           8194 Lien Street      4032              QLD
3998         4003            320 Acker Drive      2251              NSW

        country  property_valuation
0     Australia                  10
1     Australia                  10
2     Australia                   9
3     Australia                   4
4     Australia                   9
...         ...                 ...
3994  Australia                   3
3995  Australia                   6
3996  Australia                  10
3997  Australia                   7
3998  Australia                   7

[3999 rows x 6 columns]>

In [7]:
df.describe()

       customer_id     postcode  property_valuation
count  3999.000000  3999.000000         3999.000000
mean   2003.987997  2985.755939            7.514379
std    1154.576912   844.878364            2.824663
min       1.000000  2000.000000            1.000000
25%    1004.500000  2200.000000            6.000000
50%    2004.000000  2768.000000            8.000000
75%    3003.500000  3750.000000           10.000000
max    4003.000000  4883.000000           12.000000

In [8]:
df.describe(include="all")

,customer_id,address,postcode,state,country,property_valuation
count,3999.000000,3999,3999.000000,3999,3999,3999.000000
unique,NaN,3996,NaN,5,1,NaN
top,NaN,64 Macpherson Junction,NaN,NSW,Australia,NaN
freq,NaN,2,NaN,2054,3999,NaN
mean,2003.987997,NaN,2985.755939,NaN,NaN,7.514379
std,1154.576912,NaN,844.878364,NaN,NaN,2.824663
min,1.000000,NaN,2000.000000,NaN,NaN,1.000000
25%,1004.500000,NaN,2200.000000,NaN,NaN,6.000000
50%,2004.000000,NaN,2768.000000,NaN,NaN,8.000000
75%,3003.500000,NaN,3750.000000,NaN,NaN,10.000000
max,4003.000000,NaN,4883.000000,NaN,NaN,12.000000

In [ ]:
#  missing values

In [9]:
df = df.replace(r'^\s*$', np.nan, regex=True)

In [10]:
missing_data = df.isnull()

In [11]:
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

customer_id
False    3999
Name: customer_id, dtype: int64

address
False    3999
Name: address, dtype: int64

postcode
False    3999
Name: postcode, dtype: int64

state
False    3999
Name: state, dtype: int64

country
False    3999
Name: country, dtype: int64

property_valuation
False    3999
Name: property_valuation, dtype: int64